/*
Navicat MySQL Data Transfer

Source Server         : localhost_3306
Source Server Version : 50724
Source Host           : localhost:3306
Source Database       : firewall_system

Target Server Type    : MYSQL
Target Server Version : 50724
File Encoding         : 65001

Date: 2019-04-03 21:09:08
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `ip`
-- ----------------------------
DROP TABLE IF EXISTS `ip`;
CREATE TABLE `ip` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `ip_address` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4;

-- ----------------------------
-- Records of ip
-- ----------------------------
INSERT INTO `ip` VALUES ('2', '218.64.56.38');

-- ----------------------------
-- Table structure for `log`
-- ----------------------------
DROP TABLE IF EXISTS `log`;
CREATE TABLE `log` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `detail_log` varchar(4000) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=150 DEFAULT CHARSET=utf8mb4;

-- ----------------------------
-- Records of log
-- ----------------------------
INSERT INTO `log` VALUES ('1', '2019-04-03 10:56:33 127.0.0.1[:127.0.0.1]:13794->lib.ncu.edu.cn[210.35.251.117]:80发起连接\n');
INSERT INTO `log` VALUES ('2', '2019-04-03 10:56:34 127.0.0.1[:127.0.0.1]:13793->lib.ncu.edu.cn[210.35.251.117]:80发起连接\n');
INSERT INTO `log` VALUES ('3', '2019-04-03 10:56:35 拦截了127.0.0.1[:127.0.0.1]:13805->cet.neea.edu.cn[220.170.48.80]:80的访问\n');
INSERT INTO `log` VALUES ('4', '2019-04-03 10:56:36 member.chinaacc.com[140.143.179.243]:80->127.0.0.1[:127.0.0.1]:13740传输完成，耗时75294毫秒\n');
INSERT INTO `log` VALUES ('5', '2019-04-03 10:56:38 127.0.0.1[:127.0.0.1]:13816->ncu.co.cnki.net[103.26.1.102]:80发起连接\n');
INSERT INTO `log` VALUES ('6', '2019-04-03 10:56:38 ncu.co.cnki.net[103.26.1.102]:80->127.0.0.1[:127.0.0.1]:13816传输完成，耗时267毫秒\n');
INSERT INTO `log` VALUES ('7', '2019-04-03 10:56:38 127.0.0.1[:127.0.0.1]:13817->ncu.co.cnki.net[103.26.1.102]:80发起连接\n');
INSERT INTO `log` VALUES ('8', '2019-04-03 10:56:38 ncu.co.cnki.net[103.26.1.102]:80->127.0.0.1[:127.0.0.1]:13817传输完成，耗时548毫秒\n');
INSERT INTO `log` VALUES ('9', '2019-04-03 10:56:38 127.0.0.1[:127.0.0.1]:13831->ncu.co.cnki.net[103.26.1.102]:80发起连接\n');
INSERT INTO `log` VALUES ('10', '2019-04-03 10:56:38 127.0.0.1[:127.0.0.1]:13834->ncu.co.cnki.net[103.26.1.102]:80发起连接\n');
INSERT INTO `log` VALUES ('11', '2019-04-03 10:56:39 ncu.co.cnki.net[103.26.1.102]:80->127.0.0.1[:127.0.0.1]:13831传输完成，耗时150毫秒\n');
INSERT INTO `log` VALUES ('12', '2019-04-03 10:56:39 127.0.0.1[:127.0.0.1]:13842->ncu.co.cnki.net[103.26.1.102]:80发起连接\n');
INSERT INTO `log` VALUES ('13', '2019-04-03 10:56:39 ncu.co.cnki.net[103.26.1.102]:80->127.0.0.1[:127.0.0.1]:13834传输完成，耗时149毫秒\n');
INSERT INTO `log` VALUES ('14', '2019-04-03 10:56:39 127.0.0.1[:127.0.0.1]:13848->ncu.co.cnki.net[103.26.1.102]:80发起连接\n');
INSERT INTO `log` VALUES ('15', '2019-04-03 10:56:39 ncu.co.cnki.net[103.26.1.102]:80->127.0.0.1[:127.0.0.1]:13842传输完成，耗时165毫秒\n');
INSERT INTO `log` VALUES ('16', '2019-04-03 10:56:39 127.0.0.1[:127.0.0.1]:13853->ncu.co.cnki.net[103.26.1.102]:80发起连接\n');
INSERT INTO `log` VALUES ('17', '2019-04-03 10:56:39 ncu.co.cnki.net[103.26.1.102]:80->127.0.0.1[:127.0.0.1]:13848传输完成，耗时142毫秒\n');
INSERT INTO `log` VALUES ('18', '2019-04-03 10:56:39 ncu.co.cnki.net[103.26.1.102]:80->127.0.0.1[:127.0.0.1]:13853传输完成，耗时178毫秒\n');
INSERT INTO `log` VALUES ('19', '2019-04-03 10:56:39 lib.ncu.edu.cn[210.35.251.117]:80->127.0.0.1[:127.0.0.1]:13794传输完成，耗时5930毫秒\n');
INSERT INTO `log` VALUES ('20', '2019-04-03 10:56:39 127.0.0.1[:127.0.0.1]:13863->rsc.ncu.edu.cn[218.64.56.36]:80发起连接\n');
INSERT INTO `log` VALUES ('21', '2019-04-03 10:56:39 127.0.0.1[:127.0.0.1]:13864->rsc.ncu.edu.cn[218.64.56.36]:80发起连接\n');
INSERT INTO `log` VALUES ('22', '2019-04-03 10:56:39 127.0.0.1[:127.0.0.1]:13870->rsc.ncu.edu.cn[218.64.56.36]:80发起连接\n');
INSERT INTO `log` VALUES ('23', '2019-04-03 10:56:40 lib.ncu.edu.cn[210.35.251.117]:80->127.0.0.1[:127.0.0.1]:13793传输完成，耗时6945毫秒\n');
INSERT INTO `log` VALUES ('24', '2019-04-03 10:56:40 127.0.0.1[:127.0.0.1]:13879->lib.ncu.edu.cn[210.35.251.117]:80发起连接\n');
INSERT INTO `log` VALUES ('25', '2019-04-03 10:56:41 127.0.0.1[:127.0.0.1]:13795->210.35.251.243[210.35.251.243]:80发起连接\n');
INSERT INTO `log` VALUES ('26', '2019-04-03 10:56:41 127.0.0.1[:127.0.0.1]:13887->lib.ncu.edu.cn[210.35.251.117]:80发起连接\n');
INSERT INTO `log` VALUES ('27', '2019-04-03 10:56:41 拦截了127.0.0.1[:127.0.0.1]:13895->www.ncu.edu.cn[218.64.56.38]:80的访问\n');
INSERT INTO `log` VALUES ('28', '2019-04-03 10:56:41 拦截了127.0.0.1[:127.0.0.1]:13896->www.ncu.edu.cn[218.64.56.38]:80的访问\n');
INSERT INTO `log` VALUES ('29', '2019-04-03 10:56:41 拦截了127.0.0.1[:127.0.0.1]:13906->www.ncu.edu.cn[218.64.56.38]:80的访问\n');
INSERT INTO `log` VALUES ('30', '2019-04-03 10:56:43 拦截了127.0.0.1[:127.0.0.1]:13806->cet.neea.edu.cn[220.170.48.80]:80的访问\n');
INSERT INTO `log` VALUES ('31', '2019-04-03 10:56:44 拦截了127.0.0.1[:127.0.0.1]:13914->cet.neea.edu.cn[220.170.48.80]:80的访问\n');
INSERT INTO `log` VALUES ('32', '2019-04-03 10:56:44 拦截了127.0.0.1[:127.0.0.1]:13922->cet.neea.edu.cn[220.170.48.80]:80的访问\n');
INSERT INTO `log` VALUES ('33', '2019-04-03 10:56:44 rsc.ncu.edu.cn[218.64.56.36]:80->127.0.0.1[:127.0.0.1]:13863传输完成，耗时5089毫秒\n');
INSERT INTO `log` VALUES ('34', '2019-04-03 10:56:45 rsc.ncu.edu.cn[218.64.56.36]:80->127.0.0.1[:127.0.0.1]:13864传输完成，耗时5465毫秒\n');
INSERT INTO `log` VALUES ('35', '2019-04-03 10:56:45 rsc.ncu.edu.cn[218.64.56.36]:80->127.0.0.1[:127.0.0.1]:13870传输完成，耗时5338毫秒\n');
INSERT INTO `log` VALUES ('36', '2019-04-03 10:56:45 127.0.0.1[:127.0.0.1]:13930->rsc.ncu.edu.cn[218.64.56.36]:80发起连接\n');
INSERT INTO `log` VALUES ('37', '2019-04-03 10:56:45 127.0.0.1[:127.0.0.1]:13865->tj.ncu.edu.cn[218.64.56.58]:80发起连接\n');
INSERT INTO `log` VALUES ('38', '2019-04-03 10:56:46 lib.ncu.edu.cn[210.35.251.117]:80->127.0.0.1[:127.0.0.1]:13879传输完成，耗时5985毫秒\n');
INSERT INTO `log` VALUES ('39', '2019-04-03 10:56:47 210.35.251.243[210.35.251.243]:80->127.0.0.1[:127.0.0.1]:13795传输完成，耗时13630毫秒\n');
INSERT INTO `log` VALUES ('40', '2019-04-03 10:56:47 lib.ncu.edu.cn[210.35.251.117]:80->127.0.0.1[:127.0.0.1]:13887传输完成，耗时6014毫秒\n');
INSERT INTO `log` VALUES ('41', '2019-04-03 10:56:47 127.0.0.1[:127.0.0.1]:13942->lib.ncu.edu.cn[210.35.251.117]:80发起连接\n');
INSERT INTO `log` VALUES ('42', '2019-04-03 10:56:50 rsc.ncu.edu.cn[218.64.56.36]:80->127.0.0.1[:127.0.0.1]:13930传输完成，耗时5349毫秒\n');
INSERT INTO `log` VALUES ('43', '2019-04-03 10:56:52 lib.ncu.edu.cn[210.35.251.117]:80->127.0.0.1[:127.0.0.1]:13942传输完成，耗时5737毫秒\n');
INSERT INTO `log` VALUES ('44', '2019-04-03 10:56:54 127.0.0.1[:127.0.0.1]:13954->ocsp2.digicert.com[117.18.237.29]:80发起连接\n');
INSERT INTO `log` VALUES ('45', '2019-04-03 10:56:55 拦截了127.0.0.1[:127.0.0.1]:13961->dl.op.wpscdn.cn[202.109.158.12]:80的访问\n');
INSERT INTO `log` VALUES ('46', '2019-04-03 10:57:12 拦截了127.0.0.1[:127.0.0.1]:13974->lib.ncu.edu.cn[210.35.251.117]:80的访问\n');
INSERT INTO `log` VALUES ('47', '2019-04-03 10:57:12 拦截了127.0.0.1[:127.0.0.1]:13973->lib.ncu.edu.cn[210.35.251.117]:80的访问\n');
INSERT INTO `log` VALUES ('48', '2019-04-03 10:57:12 拦截了127.0.0.1[:127.0.0.1]:13984->lib.ncu.edu.cn[210.35.251.117]:80的访问\n');
INSERT INTO `log` VALUES ('49', '2019-04-03 10:57:13 拦截了127.0.0.1[:127.0.0.1]:13989->lib.ncu.edu.cn[210.35.251.117]:80的访问\n');
INSERT INTO `log` VALUES ('50', '2019-04-03 10:57:13 拦截了127.0.0.1[:127.0.0.1]:13990->lib.ncu.edu.cn[210.35.251.117]:80的访问\n');
INSERT INTO `log` VALUES ('51', '2019-04-03 10:57:13 拦截了127.0.0.1[:127.0.0.1]:13999->lib.ncu.edu.cn[210.35.251.117]:80的访问\n');
INSERT INTO `log` VALUES ('52', '2019-04-03 10:57:14 拦截了127.0.0.1[:127.0.0.1]:14004->lib.ncu.edu.cn[210.35.251.117]:80的访问\n');
INSERT INTO `log` VALUES ('53', '2019-04-03 10:57:14 拦截了127.0.0.1[:127.0.0.1]:14005->lib.ncu.edu.cn[210.35.251.117]:80的访问\n');
INSERT INTO `log` VALUES ('54', '2019-04-03 10:57:14 拦截了127.0.0.1[:127.0.0.1]:14014->lib.ncu.edu.cn[210.35.251.117]:80的访问\n');
INSERT INTO `log` VALUES ('55', '2019-04-03 10:57:14 拦截了127.0.0.1[:127.0.0.1]:14020->lib.ncu.edu.cn[210.35.251.117]:80的访问\n');
INSERT INTO `log` VALUES ('56', '2019-04-03 10:57:14 拦截了127.0.0.1[:127.0.0.1]:14021->lib.ncu.edu.cn[210.35.251.117]:80的访问\n');
INSERT INTO `log` VALUES ('57', '2019-04-03 10:57:15 拦截了127.0.0.1[:127.0.0.1]:14031->lib.ncu.edu.cn[210.35.251.117]:80的访问\n');
INSERT INTO `log` VALUES ('58', '2019-04-03 10:57:16 127.0.0.1[:127.0.0.1]:14036->cet.neea.edu.cn[220.170.48.80]:80发起连接\n');
INSERT INTO `log` VALUES ('59', '2019-04-03 10:57:17 拦截了127.0.0.1[:127.0.0.1]:14038->c.cnzz.com[59.63.247.232]:80的访问\n');
INSERT INTO `log` VALUES ('60', '2019-04-03 10:57:17 拦截了127.0.0.1[:127.0.0.1]:14039->z13.cnzz.com[203.119.129.115]:80的访问\n');
INSERT INTO `log` VALUES ('61', '2019-04-03 10:57:17 拦截了127.0.0.1[:127.0.0.1]:14054->c.cnzz.com[59.63.247.232]:80的访问\n');
INSERT INTO `log` VALUES ('62', '2019-04-03 10:57:17 拦截了127.0.0.1[:127.0.0.1]:14058->z13.cnzz.com[203.119.129.115]:80的访问\n');
INSERT INTO `log` VALUES ('63', '2019-04-03 10:57:20 拦截了127.0.0.1[:127.0.0.1]:14066->rsc.ncu.edu.cn[218.64.56.36]:80的访问\n');
INSERT INTO `log` VALUES ('64', '2019-04-03 10:57:20 拦截了127.0.0.1[:127.0.0.1]:14065->rsc.ncu.edu.cn[218.64.56.36]:80的访问\n');
INSERT INTO `log` VALUES ('65', '2019-04-03 10:57:20 拦截了127.0.0.1[:127.0.0.1]:14075->rsc.ncu.edu.cn[218.64.56.36]:80的访问\n');
INSERT INTO `log` VALUES ('66', '2019-04-03 10:57:21 拦截了127.0.0.1[:127.0.0.1]:14081->rsc.ncu.edu.cn[218.64.56.36]:80的访问\n');
INSERT INTO `log` VALUES ('67', '2019-04-03 10:57:21 拦截了127.0.0.1[:127.0.0.1]:14080->rsc.ncu.edu.cn[218.64.56.36]:80的访问\n');
INSERT INTO `log` VALUES ('68', '2019-04-03 10:57:21 拦截了127.0.0.1[:127.0.0.1]:14090->rsc.ncu.edu.cn[218.64.56.36]:80的访问\n');
INSERT INTO `log` VALUES ('69', '2019-04-03 10:57:22 拦截了127.0.0.1[:127.0.0.1]:14097->ncu.co.cnki.net[103.26.1.102]:80的访问\n');
INSERT INTO `log` VALUES ('70', '2019-04-03 10:57:22 拦截了127.0.0.1[:127.0.0.1]:14096->ncu.co.cnki.net[103.26.1.102]:80的访问\n');
INSERT INTO `log` VALUES ('71', '2019-04-03 10:57:22 拦截了127.0.0.1[:127.0.0.1]:14108->ncu.co.cnki.net[103.26.1.102]:80的访问\n');
INSERT INTO `log` VALUES ('72', '2019-04-03 10:57:22 拦截了127.0.0.1[:127.0.0.1]:14114->ncu.co.cnki.net[103.26.1.102]:80的访问\n');
INSERT INTO `log` VALUES ('73', '2019-04-03 10:57:22 拦截了127.0.0.1[:127.0.0.1]:14113->ncu.co.cnki.net[103.26.1.102]:80的访问\n');
INSERT INTO `log` VALUES ('74', '2019-04-03 10:57:23 拦截了127.0.0.1[:127.0.0.1]:14123->ncu.co.cnki.net[103.26.1.102]:80的访问\n');
INSERT INTO `log` VALUES ('75', '2019-04-03 10:57:24 127.0.0.1[:127.0.0.1]:14128->www.ncu.edu.cn[218.64.56.38]:80发起连接\n');
INSERT INTO `log` VALUES ('76', '2019-04-03 10:57:24 www.ncu.edu.cn[218.64.56.38]:80->127.0.0.1[:127.0.0.1]:14128传输完成，耗时242毫秒\n');
INSERT INTO `log` VALUES ('77', '2019-04-03 10:57:26 cet.neea.edu.cn[220.170.48.80]:80->127.0.0.1[:127.0.0.1]:14036传输完成，耗时10221毫秒\n');
INSERT INTO `log` VALUES ('78', '2019-04-03 10:57:26 127.0.0.1[:127.0.0.1]:14136->cet.neea.edu.cn[220.170.48.80]:80发起连接\n');
INSERT INTO `log` VALUES ('79', '2019-04-03 10:57:37 cet.neea.edu.cn[220.170.48.80]:80->127.0.0.1[:127.0.0.1]:14136传输完成，耗时10326毫秒\n');
INSERT INTO `log` VALUES ('80', '2019-04-03 10:57:45 tj.ncu.edu.cn[218.64.56.58]:80->127.0.0.1[:127.0.0.1]:13865传输完成，耗时66074毫秒\n');
INSERT INTO `log` VALUES ('81', '2019-04-03 10:57:45 拦截了127.0.0.1[:127.0.0.1]:14149->tj.ncu.edu.cn[218.64.56.58]:80的访问\n');
INSERT INTO `log` VALUES ('82', '2019-04-03 10:57:46 127.0.0.1[:127.0.0.1]:14155->www.ncu.edu.cn[218.64.56.38]:80发起连接\n');
INSERT INTO `log` VALUES ('83', '2019-04-03 10:57:46 www.ncu.edu.cn[218.64.56.38]:80->127.0.0.1[:127.0.0.1]:14155传输完成，耗时285毫秒\n');
INSERT INTO `log` VALUES ('84', '2019-04-03 10:57:55 127.0.0.1[:127.0.0.1]:14164->dl.op.wpscdn.cn[202.109.158.14]:80发起连接\n');
INSERT INTO `log` VALUES ('85', '2019-04-03 10:58:30 dl.op.wpscdn.cn[202.109.158.14]:80->127.0.0.1[:127.0.0.1]:14164传输完成，耗时35252毫秒\n');
INSERT INTO `log` VALUES ('86', '2019-04-03 10:59:09 代理终止\n');
INSERT INTO `log` VALUES ('87', '2019-04-03 10:59:09 127.0.0.1[:127.0.0.1]:14186->tile-service.weather.microsoft.com[23.220.168.168]:80发起连接\n');
INSERT INTO `log` VALUES ('88', '2019-04-03 10:59:09 tile-service.weather.microsoft.com[23.220.168.168]:80->127.0.0.1[:127.0.0.1]:14186传输完成，耗时667毫秒\n');
INSERT INTO `log` VALUES ('89', '2019-04-03 10:59:10 ocsp2.digicert.com[117.18.237.29]:80->127.0.0.1[:127.0.0.1]:13954传输完成，耗时136496毫秒\n');
INSERT INTO `log` VALUES ('90', '2019-04-03 20:58:08 代理启动\n');
INSERT INTO `log` VALUES ('91', '2019-04-03 20:58:13 127.0.0.1[:127.0.0.1]:14716->lib.ncu.edu.cn[210.35.251.117]:80发起连接\n');
INSERT INTO `log` VALUES ('92', '2019-04-03 20:58:14 127.0.0.1[:127.0.0.1]:14718->210.35.251.243[210.35.251.243]:80发起连接\n');
INSERT INTO `log` VALUES ('93', '2019-04-03 20:58:15 127.0.0.1[:127.0.0.1]:14717->lib.ncu.edu.cn[210.35.251.117]:80发起连接\n');
INSERT INTO `log` VALUES ('94', '2019-04-03 20:58:15 127.0.0.1[:127.0.0.1]:14731->lib.ncu.edu.cn[210.35.251.117]:80发起连接\n');
INSERT INTO `log` VALUES ('95', '2019-04-03 20:58:19 lib.ncu.edu.cn[210.35.251.117]:80->127.0.0.1[:127.0.0.1]:14716传输完成，耗时6108毫秒\n');
INSERT INTO `log` VALUES ('96', '2019-04-03 20:58:20 210.35.251.243[210.35.251.243]:80->127.0.0.1[:127.0.0.1]:14718传输完成，耗时6948毫秒\n');
INSERT INTO `log` VALUES ('97', '2019-04-03 20:58:21 lib.ncu.edu.cn[210.35.251.117]:80->127.0.0.1[:127.0.0.1]:14717传输完成，耗时7751毫秒\n');
INSERT INTO `log` VALUES ('98', '2019-04-03 20:58:21 lib.ncu.edu.cn[210.35.251.117]:80->127.0.0.1[:127.0.0.1]:14731传输完成，耗时6092毫秒\n');
INSERT INTO `log` VALUES ('99', '2019-04-03 20:58:21 127.0.0.1[:127.0.0.1]:14746->lib.ncu.edu.cn[210.35.251.117]:80发起连接\n');
INSERT INTO `log` VALUES ('100', '2019-04-03 20:58:27 lib.ncu.edu.cn[210.35.251.117]:80->127.0.0.1[:127.0.0.1]:14746传输完成，耗时6049毫秒\n');
INSERT INTO `log` VALUES ('101', '2019-04-03 20:58:43 127.0.0.1[:127.0.0.1]:14759->ctldl.windowsupdate.com[106.7.64.5]:80发起连接\n');
INSERT INTO `log` VALUES ('102', '2019-04-03 20:59:06 拦截了127.0.0.1[:127.0.0.1]:14773->dl.op.wpscdn.cn[202.109.158.13]:80的访问\n');
INSERT INTO `log` VALUES ('103', '2019-04-03 20:59:43 代理终止\n');
INSERT INTO `log` VALUES ('104', '2019-04-03 21:06:11 代理启动\n');
INSERT INTO `log` VALUES ('105', '2019-04-03 21:06:18 拦截了127.0.0.1[:127.0.0.1]:14979->dl.op.wpscdn.cn[59.63.247.226]:80的访问\n');
INSERT INTO `log` VALUES ('106', '2019-04-03 21:06:26 127.0.0.1[:127.0.0.1]:14986->ncu.co.cnki.net[103.26.1.102]:80发起连接\n');
INSERT INTO `log` VALUES ('107', '2019-04-03 21:06:26 ncu.co.cnki.net[103.26.1.102]:80->127.0.0.1[:127.0.0.1]:14986传输完成，耗时271毫秒\n');
INSERT INTO `log` VALUES ('108', '2019-04-03 21:06:27 127.0.0.1[:127.0.0.1]:14987->ncu.co.cnki.net[103.26.1.102]:80发起连接\n');
INSERT INTO `log` VALUES ('109', '2019-04-03 21:06:27 拦截了127.0.0.1[:127.0.0.1]:14988->res.wx.qq.com[59.63.235.57]:80的访问\n');
INSERT INTO `log` VALUES ('110', '2019-04-03 21:06:27 拦截了127.0.0.1[:127.0.0.1]:1026->res.wx.qq.com[59.63.235.57]:80的访问\n');
INSERT INTO `log` VALUES ('111', '2019-04-03 21:06:27 ncu.co.cnki.net[103.26.1.102]:80->127.0.0.1[:127.0.0.1]:14987传输完成，耗时646毫秒\n');
INSERT INTO `log` VALUES ('112', '2019-04-03 21:06:27 127.0.0.1[:127.0.0.1]:1032->ncu.co.cnki.net[103.26.1.102]:80发起连接\n');
INSERT INTO `log` VALUES ('113', '2019-04-03 21:06:27 ncu.co.cnki.net[103.26.1.102]:80->127.0.0.1[:127.0.0.1]:1032传输完成，耗时230毫秒\n');
INSERT INTO `log` VALUES ('114', '2019-04-03 21:06:27 127.0.0.1[:127.0.0.1]:1038->ncu.co.cnki.net[103.26.1.102]:80发起连接\n');
INSERT INTO `log` VALUES ('115', '2019-04-03 21:06:27 127.0.0.1[:127.0.0.1]:1040->ncu.co.cnki.net[103.26.1.102]:80发起连接\n');
INSERT INTO `log` VALUES ('116', '2019-04-03 21:06:28 ncu.co.cnki.net[103.26.1.102]:80->127.0.0.1[:127.0.0.1]:1038传输完成，耗时213毫秒\n');
INSERT INTO `log` VALUES ('117', '2019-04-03 21:06:28 127.0.0.1[:127.0.0.1]:1049->ncu.co.cnki.net[103.26.1.102]:80发起连接\n');
INSERT INTO `log` VALUES ('118', '2019-04-03 21:06:28 ncu.co.cnki.net[103.26.1.102]:80->127.0.0.1[:127.0.0.1]:1040传输完成，耗时283毫秒\n');
INSERT INTO `log` VALUES ('119', '2019-04-03 21:06:28 127.0.0.1[:127.0.0.1]:1054->ncu.co.cnki.net[103.26.1.102]:80发起连接\n');
INSERT INTO `log` VALUES ('120', '2019-04-03 21:06:28 ncu.co.cnki.net[103.26.1.102]:80->127.0.0.1[:127.0.0.1]:1054传输完成，耗时208毫秒\n');
INSERT INTO `log` VALUES ('121', '2019-04-03 21:06:28 ncu.co.cnki.net[103.26.1.102]:80->127.0.0.1[:127.0.0.1]:1049传输完成，耗时283毫秒\n');
INSERT INTO `log` VALUES ('122', '2019-04-03 21:06:28 127.0.0.1[:127.0.0.1]:1063->ncu.co.cnki.net[103.26.1.102]:80发起连接\n');
INSERT INTO `log` VALUES ('123', '2019-04-03 21:06:28 ncu.co.cnki.net[103.26.1.102]:80->127.0.0.1[:127.0.0.1]:1063传输完成，耗时188毫秒\n');
INSERT INTO `log` VALUES ('124', '2019-04-03 21:06:39 拦截了127.0.0.1[:127.0.0.1]:1074->cet.neea.edu.cn[27.148.209.147]:80的访问\n');
INSERT INTO `log` VALUES ('125', '2019-04-03 21:06:40 拦截了127.0.0.1[:127.0.0.1]:1073->cet.neea.edu.cn[27.148.209.147]:80的访问\n');
INSERT INTO `log` VALUES ('126', '2019-04-03 21:06:40 拦截了127.0.0.1[:127.0.0.1]:1087->cet.neea.edu.cn[27.148.209.147]:80的访问\n');
INSERT INTO `log` VALUES ('127', '2019-04-03 21:06:40 拦截了127.0.0.1[:127.0.0.1]:1093->cet.neea.edu.cn[27.148.209.147]:80的访问\n');
INSERT INTO `log` VALUES ('128', '2019-04-03 21:06:40 拦截了127.0.0.1[:127.0.0.1]:1092->cet.neea.edu.cn[27.148.209.147]:80的访问\n');
INSERT INTO `log` VALUES ('129', '2019-04-03 21:06:40 拦截了127.0.0.1[:127.0.0.1]:1102->cet.neea.edu.cn[27.148.209.147]:80的访问\n');
INSERT INTO `log` VALUES ('130', '2019-04-03 21:06:45 拦截了127.0.0.1[:127.0.0.1]:1108->cet.neea.edu.cn[27.148.209.147]:80的访问\n');
INSERT INTO `log` VALUES ('131', '2019-04-03 21:06:49 拦截了127.0.0.1[:127.0.0.1]:1116->www.ncu.edu.cn[218.64.56.38]:80的访问\n');
INSERT INTO `log` VALUES ('132', '2019-04-03 21:06:49 拦截了127.0.0.1[:127.0.0.1]:1117->www.ncu.edu.cn[218.64.56.38]:80的访问\n');
INSERT INTO `log` VALUES ('133', '2019-04-03 21:06:49 拦截了127.0.0.1[:127.0.0.1]:1128->www.ncu.edu.cn[218.64.56.38]:80的访问\n');
INSERT INTO `log` VALUES ('134', '2019-04-03 21:06:49 拦截了127.0.0.1[:127.0.0.1]:1134->www.ncu.edu.cn[218.64.56.38]:80的访问\n');
INSERT INTO `log` VALUES ('135', '2019-04-03 21:06:53 127.0.0.1[:127.0.0.1]:1141->rsc.ncu.edu.cn[218.64.56.36]:80发起连接\n');
INSERT INTO `log` VALUES ('136', '2019-04-03 21:06:53 127.0.0.1[:127.0.0.1]:1140->rsc.ncu.edu.cn[218.64.56.36]:80发起连接\n');
INSERT INTO `log` VALUES ('137', '2019-04-03 21:06:53 127.0.0.1[:127.0.0.1]:1148->rsc.ncu.edu.cn[218.64.56.36]:80发起连接\n');
INSERT INTO `log` VALUES ('138', '2019-04-03 21:06:58 rsc.ncu.edu.cn[218.64.56.36]:80->127.0.0.1[:127.0.0.1]:1141传输完成，耗时5217毫秒\n');
INSERT INTO `log` VALUES ('139', '2019-04-03 21:06:58 rsc.ncu.edu.cn[218.64.56.36]:80->127.0.0.1[:127.0.0.1]:1140传输完成，耗时5402毫秒\n');
INSERT INTO `log` VALUES ('140', '2019-04-03 21:06:58 rsc.ncu.edu.cn[218.64.56.36]:80->127.0.0.1[:127.0.0.1]:1148传输完成，耗时5228毫秒\n');
INSERT INTO `log` VALUES ('141', '2019-04-03 21:06:58 127.0.0.1[:127.0.0.1]:1160->rsc.ncu.edu.cn[218.64.56.36]:80发起连接\n');
INSERT INTO `log` VALUES ('142', '2019-04-03 21:06:59 127.0.0.1[:127.0.0.1]:1166->tj.ncu.edu.cn[218.64.56.58]:80发起连接\n');
INSERT INTO `log` VALUES ('143', '2019-04-03 21:07:01 127.0.0.1[:127.0.0.1]:1171->pan.baidu.com[180.149.145.241]:80发起连接\n');
INSERT INTO `log` VALUES ('144', '2019-04-03 21:07:04 rsc.ncu.edu.cn[218.64.56.36]:80->127.0.0.1[:127.0.0.1]:1160传输完成，耗时5641毫秒\n');
INSERT INTO `log` VALUES ('145', '2019-04-03 21:07:18 拦截了127.0.0.1[:127.0.0.1]:1186->dl.op.wpscdn.cn[124.232.162.203]:80的访问\n');
INSERT INTO `log` VALUES ('146', '2019-04-03 21:07:31 pan.baidu.com[180.149.145.241]:80->127.0.0.1[:127.0.0.1]:1171传输完成，耗时30447毫秒\n');
INSERT INTO `log` VALUES ('147', '2019-04-03 21:08:01 tj.ncu.edu.cn[218.64.56.58]:80->127.0.0.1[:127.0.0.1]:1166传输完成，耗时61973毫秒\n');
INSERT INTO `log` VALUES ('148', '2019-04-03 21:08:19 代理终止\n');
INSERT INTO `log` VALUES ('149', '2019-04-03 21:08:19 拦截了127.0.0.1[:127.0.0.1]:1216->dl.op.wpscdn.cn[124.232.162.203]:80的访问\n');

-- ----------------------------
-- Table structure for `record`
-- ----------------------------
DROP TABLE IF EXISTS `record`;
CREATE TABLE `record` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `reject_record` varchar(3000) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=55 DEFAULT CHARSET=utf8mb4;

-- ----------------------------
-- Records of record
-- ----------------------------
INSERT INTO `record` VALUES ('1', '2019-04-03 10:56:35 拦截了127.0.0.1[:127.0.0.1]:13805->cet.neea.edu.cn[220.170.48.80]:80的访问\n');
INSERT INTO `record` VALUES ('2', '2019-04-03 10:56:41 拦截了127.0.0.1[:127.0.0.1]:13895->www.ncu.edu.cn[218.64.56.38]:80的访问\n');
INSERT INTO `record` VALUES ('3', '2019-04-03 10:56:41 拦截了127.0.0.1[:127.0.0.1]:13896->www.ncu.edu.cn[218.64.56.38]:80的访问\n');
INSERT INTO `record` VALUES ('4', '2019-04-03 10:56:41 拦截了127.0.0.1[:127.0.0.1]:13906->www.ncu.edu.cn[218.64.56.38]:80的访问\n');
INSERT INTO `record` VALUES ('5', '2019-04-03 10:56:43 拦截了127.0.0.1[:127.0.0.1]:13806->cet.neea.edu.cn[220.170.48.80]:80的访问\n');
INSERT INTO `record` VALUES ('6', '2019-04-03 10:56:44 拦截了127.0.0.1[:127.0.0.1]:13914->cet.neea.edu.cn[220.170.48.80]:80的访问\n');
INSERT INTO `record` VALUES ('7', '2019-04-03 10:56:44 拦截了127.0.0.1[:127.0.0.1]:13922->cet.neea.edu.cn[220.170.48.80]:80的访问\n');
INSERT INTO `record` VALUES ('8', '2019-04-03 10:56:55 拦截了127.0.0.1[:127.0.0.1]:13961->dl.op.wpscdn.cn[202.109.158.12]:80的访问\n');
INSERT INTO `record` VALUES ('9', '2019-04-03 10:57:12 拦截了127.0.0.1[:127.0.0.1]:13974->lib.ncu.edu.cn[210.35.251.117]:80的访问\n');
INSERT INTO `record` VALUES ('10', '2019-04-03 10:57:12 拦截了127.0.0.1[:127.0.0.1]:13973->lib.ncu.edu.cn[210.35.251.117]:80的访问\n');
INSERT INTO `record` VALUES ('11', '2019-04-03 10:57:12 拦截了127.0.0.1[:127.0.0.1]:13984->lib.ncu.edu.cn[210.35.251.117]:80的访问\n');
INSERT INTO `record` VALUES ('12', '2019-04-03 10:57:13 拦截了127.0.0.1[:127.0.0.1]:13989->lib.ncu.edu.cn[210.35.251.117]:80的访问\n');
INSERT INTO `record` VALUES ('13', '2019-04-03 10:57:13 拦截了127.0.0.1[:127.0.0.1]:13990->lib.ncu.edu.cn[210.35.251.117]:80的访问\n');
INSERT INTO `record` VALUES ('14', '2019-04-03 10:57:13 拦截了127.0.0.1[:127.0.0.1]:13999->lib.ncu.edu.cn[210.35.251.117]:80的访问\n');
INSERT INTO `record` VALUES ('15', '2019-04-03 10:57:14 拦截了127.0.0.1[:127.0.0.1]:14004->lib.ncu.edu.cn[210.35.251.117]:80的访问\n');
INSERT INTO `record` VALUES ('16', '2019-04-03 10:57:14 拦截了127.0.0.1[:127.0.0.1]:14005->lib.ncu.edu.cn[210.35.251.117]:80的访问\n');
INSERT INTO `record` VALUES ('17', '2019-04-03 10:57:14 拦截了127.0.0.1[:127.0.0.1]:14014->lib.ncu.edu.cn[210.35.251.117]:80的访问\n');
INSERT INTO `record` VALUES ('18', '2019-04-03 10:57:14 拦截了127.0.0.1[:127.0.0.1]:14020->lib.ncu.edu.cn[210.35.251.117]:80的访问\n');
INSERT INTO `record` VALUES ('19', '2019-04-03 10:57:14 拦截了127.0.0.1[:127.0.0.1]:14021->lib.ncu.edu.cn[210.35.251.117]:80的访问\n');
INSERT INTO `record` VALUES ('20', '2019-04-03 10:57:15 拦截了127.0.0.1[:127.0.0.1]:14031->lib.ncu.edu.cn[210.35.251.117]:80的访问\n');
INSERT INTO `record` VALUES ('21', '2019-04-03 10:57:17 拦截了127.0.0.1[:127.0.0.1]:14038->c.cnzz.com[59.63.247.232]:80的访问\n');
INSERT INTO `record` VALUES ('22', '2019-04-03 10:57:17 拦截了127.0.0.1[:127.0.0.1]:14039->z13.cnzz.com[203.119.129.115]:80的访问\n');
INSERT INTO `record` VALUES ('23', '2019-04-03 10:57:17 拦截了127.0.0.1[:127.0.0.1]:14054->c.cnzz.com[59.63.247.232]:80的访问\n');
INSERT INTO `record` VALUES ('24', '2019-04-03 10:57:17 拦截了127.0.0.1[:127.0.0.1]:14058->z13.cnzz.com[203.119.129.115]:80的访问\n');
INSERT INTO `record` VALUES ('25', '2019-04-03 10:57:20 拦截了127.0.0.1[:127.0.0.1]:14066->rsc.ncu.edu.cn[218.64.56.36]:80的访问\n');
INSERT INTO `record` VALUES ('26', '2019-04-03 10:57:20 拦截了127.0.0.1[:127.0.0.1]:14065->rsc.ncu.edu.cn[218.64.56.36]:80的访问\n');
INSERT INTO `record` VALUES ('27', '2019-04-03 10:57:20 拦截了127.0.0.1[:127.0.0.1]:14075->rsc.ncu.edu.cn[218.64.56.36]:80的访问\n');
INSERT INTO `record` VALUES ('28', '2019-04-03 10:57:21 拦截了127.0.0.1[:127.0.0.1]:14081->rsc.ncu.edu.cn[218.64.56.36]:80的访问\n');
INSERT INTO `record` VALUES ('29', '2019-04-03 10:57:21 拦截了127.0.0.1[:127.0.0.1]:14080->rsc.ncu.edu.cn[218.64.56.36]:80的访问\n');
INSERT INTO `record` VALUES ('30', '2019-04-03 10:57:21 拦截了127.0.0.1[:127.0.0.1]:14090->rsc.ncu.edu.cn[218.64.56.36]:80的访问\n');
INSERT INTO `record` VALUES ('31', '2019-04-03 10:57:22 拦截了127.0.0.1[:127.0.0.1]:14097->ncu.co.cnki.net[103.26.1.102]:80的访问\n');
INSERT INTO `record` VALUES ('32', '2019-04-03 10:57:22 拦截了127.0.0.1[:127.0.0.1]:14096->ncu.co.cnki.net[103.26.1.102]:80的访问\n');
INSERT INTO `record` VALUES ('33', '2019-04-03 10:57:22 拦截了127.0.0.1[:127.0.0.1]:14108->ncu.co.cnki.net[103.26.1.102]:80的访问\n');
INSERT INTO `record` VALUES ('34', '2019-04-03 10:57:22 拦截了127.0.0.1[:127.0.0.1]:14114->ncu.co.cnki.net[103.26.1.102]:80的访问\n');
INSERT INTO `record` VALUES ('35', '2019-04-03 10:57:22 拦截了127.0.0.1[:127.0.0.1]:14113->ncu.co.cnki.net[103.26.1.102]:80的访问\n');
INSERT INTO `record` VALUES ('36', '2019-04-03 10:57:23 拦截了127.0.0.1[:127.0.0.1]:14123->ncu.co.cnki.net[103.26.1.102]:80的访问\n');
INSERT INTO `record` VALUES ('37', '2019-04-03 10:57:45 拦截了127.0.0.1[:127.0.0.1]:14149->tj.ncu.edu.cn[218.64.56.58]:80的访问\n');
INSERT INTO `record` VALUES ('38', '2019-04-03 20:59:06 拦截了127.0.0.1[:127.0.0.1]:14773->dl.op.wpscdn.cn[202.109.158.13]:80的访问\n');
INSERT INTO `record` VALUES ('39', '2019-04-03 21:06:18 拦截了127.0.0.1[:127.0.0.1]:14979->dl.op.wpscdn.cn[59.63.247.226]:80的访问\n');
INSERT INTO `record` VALUES ('40', '2019-04-03 21:06:27 拦截了127.0.0.1[:127.0.0.1]:14988->res.wx.qq.com[59.63.235.57]:80的访问\n');
INSERT INTO `record` VALUES ('41', '2019-04-03 21:06:27 拦截了127.0.0.1[:127.0.0.1]:1026->res.wx.qq.com[59.63.235.57]:80的访问\n');
INSERT INTO `record` VALUES ('42', '2019-04-03 21:06:39 拦截了127.0.0.1[:127.0.0.1]:1074->cet.neea.edu.cn[27.148.209.147]:80的访问\n');
INSERT INTO `record` VALUES ('43', '2019-04-03 21:06:40 拦截了127.0.0.1[:127.0.0.1]:1073->cet.neea.edu.cn[27.148.209.147]:80的访问\n');
INSERT INTO `record` VALUES ('44', '2019-04-03 21:06:40 拦截了127.0.0.1[:127.0.0.1]:1087->cet.neea.edu.cn[27.148.209.147]:80的访问\n');
INSERT INTO `record` VALUES ('45', '2019-04-03 21:06:40 拦截了127.0.0.1[:127.0.0.1]:1093->cet.neea.edu.cn[27.148.209.147]:80的访问\n');
INSERT INTO `record` VALUES ('46', '2019-04-03 21:06:40 拦截了127.0.0.1[:127.0.0.1]:1092->cet.neea.edu.cn[27.148.209.147]:80的访问\n');
INSERT INTO `record` VALUES ('47', '2019-04-03 21:06:40 拦截了127.0.0.1[:127.0.0.1]:1102->cet.neea.edu.cn[27.148.209.147]:80的访问\n');
INSERT INTO `record` VALUES ('48', '2019-04-03 21:06:45 拦截了127.0.0.1[:127.0.0.1]:1108->cet.neea.edu.cn[27.148.209.147]:80的访问\n');
INSERT INTO `record` VALUES ('49', '2019-04-03 21:06:49 拦截了127.0.0.1[:127.0.0.1]:1116->www.ncu.edu.cn[218.64.56.38]:80的访问\n');
INSERT INTO `record` VALUES ('50', '2019-04-03 21:06:49 拦截了127.0.0.1[:127.0.0.1]:1117->www.ncu.edu.cn[218.64.56.38]:80的访问\n');
INSERT INTO `record` VALUES ('51', '2019-04-03 21:06:49 拦截了127.0.0.1[:127.0.0.1]:1128->www.ncu.edu.cn[218.64.56.38]:80的访问\n');
INSERT INTO `record` VALUES ('52', '2019-04-03 21:06:49 拦截了127.0.0.1[:127.0.0.1]:1134->www.ncu.edu.cn[218.64.56.38]:80的访问\n');
INSERT INTO `record` VALUES ('53', '2019-04-03 21:07:18 拦截了127.0.0.1[:127.0.0.1]:1186->dl.op.wpscdn.cn[124.232.162.203]:80的访问\n');
INSERT INTO `record` VALUES ('54', '2019-04-03 21:08:19 拦截了127.0.0.1[:127.0.0.1]:1216->dl.op.wpscdn.cn[124.232.162.203]:80的访问\n');

-- ----------------------------
-- Table structure for `website`
-- ----------------------------
DROP TABLE IF EXISTS `website`;
CREATE TABLE `website` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `website_name` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4;

-- ----------------------------
-- Records of website
-- ----------------------------
INSERT INTO `website` VALUES ('4', 'cet.neea.edu.cn');
INSERT INTO `website` VALUES ('5', 'res.wx.qq.com');
INSERT INTO `website` VALUES ('6', 'dl.op.wpscdn.cn');
